arduino/ArduinoCore-samd/boards.txt
mkrfox1200.upload.tool=bossac
mkrfox1200.upload.protocol=sam-ba
mkrfox1200.upload.maximum_size=262144
mkrfox1200.upload.maximum_data_size=32768
mkrfox1200.upload.use_1200bps_touch=true
mkrfox1200.upload.wait_for_upload_port=true
mkrfox1200.upload.native_usb=true
mkrfox1200.build.mcu=cortex-m0plus
mkrfox1200.build.f_cpu=48000000L
mkrfox1200.build.usb_product="Arduino MKR FOX 1200"
mkrfox1200.build.usb_manufacturer="Arduino LLC"
mkrfox1200.build.board=SAMD_MKRFox1200
mkrfox1200.build.core=arduino
mkrfox1200.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
mkrfox1200.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrfox1200.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrfox1200.build.variant=mkrfox1200
mkrfox1200.build.vid=0x2341
mkrfox1200.build.pid=0x8050
mkrfox1200.bootloader.tool=openocd
mkrfox1200.bootloader.file=mkrfox1200/samd21_sam_ba_arduino_mkrfox1200.bin

# Arduino MKR WAN 1300
# --------------------
mkrwan1300.name=Arduino MKR WAN 1300
mkrwan1300.vid.0=0x2341
mkrwan1300.pid.0=0x8053
mkrwan1300.vid.1=0x2341
mkrwan1300.pid.1=0x0053

mkrwan1300.upload.tool=bossac
mkrwan1300.upload.protocol=sam-ba
mkrwan1300.upload.maximum_size=262144
mkrwan1300.upload.maximum_data_size=32768
mkrwan1300.upload.use_1200bps_touch=true
mkrwan1300.upload.wait_for_upload_port=true
mkrwan1300.upload.native_usb=true
mkrwan1300.build.mcu=cortex-m0plus
mkrwan1300.build.f_cpu=48000000L
mkrwan1300.build.usb_product="Arduino MKR WAN 1300"
mkrwan1300.build.usb_manufacturer="Arduino LLC"
mkrwan1300.build.board=SAMD_MKRWAN1300
mkrwan1300.build.core=arduino
mkrwan1300.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
mkrwan1300.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrwan1300.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrwan1300.build.variant=mkrwan1300
mkrwan1300.build.vid=0x2341
mkrwan1300.build.pid=0x8053
mkrwan1300.bootloader.tool=openocd
mkrwan1300.bootloader.file=mkrwan1300/samd21_sam_ba_arduino_mkrwan1300.bin

# Arduino MKR WAN 1310
# --------------------
mkrwan1310.name=Arduino MKR WAN 1310
mkrwan1310.vid.0=0x2341
mkrwan1310.pid.0=0x8059
mkrwan1310.vid.1=0x2341
mkrwan1310.pid.1=0x0059

mkrwan1310.upload.tool=bossac
mkrwan1310.upload.protocol=sam-ba
mkrwan1310.upload.maximum_size=262144
mkrwan1310.upload.maximum_data_size=32768
mkrwan1310.upload.use_1200bps_touch=true
mkrwan1310.upload.wait_for_upload_port=true
mkrwan1310.upload.native_usb=true
mkrwan1310.build.mcu=cortex-m0plus
mkrwan1310.build.f_cpu=48000000L
mkrwan1310.build.usb_product="Arduino MKR WAN 1310"
mkrwan1310.build.usb_manufacturer="Arduino LLC"
mkrwan1310.build.board=SAMD_MKRWAN1310
mkrwan1310.build.core=arduino
mkrwan1310.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC -DVERY_LOW_POWER
mkrwan1310.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrwan1310.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrwan1310.build.variant=mkrwan1300
mkrwan1310.build.vid=0x2341
mkrwan1310.build.pid=0x8059
mkrwan1310.bootloader.tool=openocd
mkrwan1310.bootloader.file=mkrwan1300/samd21_sam_ba_arduino_mkrwan1310.bin

# Arduino MKR GSM 1400
# --------------------
mkrgsm1400.name=Arduino MKR GSM 1400
mkrgsm1400.vid.0=0x2341
mkrgsm1400.pid.0=0x8052
mkrgsm1400.vid.1=0x2341
mkrgsm1400.pid.1=0x0052

mkrgsm1400.upload.tool=bossac
mkrgsm1400.upload.protocol=sam-ba
mkrgsm1400.upload.maximum_size=262144
mkrgsm1400.upload.maximum_data_size=32768
mkrgsm1400.upload.use_1200bps_touch=true
mkrgsm1400.upload.wait_for_upload_port=true
mkrgsm1400.upload.native_usb=true
mkrgsm1400.build.mcu=cortex-m0plus
mkrgsm1400.build.f_cpu=48000000L
mkrgsm1400.build.usb_product="Arduino MKR GSM 1400"
mkrgsm1400.build.usb_manufacturer="Arduino LLC"
mkrgsm1400.build.board=SAMD_MKRGSM1400
mkrgsm1400.build.core=arduino
mkrgsm1400.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
mkrgsm1400.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrgsm1400.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrgsm1400.build.variant=mkrgsm1400
mkrgsm1400.build.vid=0x2341
mkrgsm1400.build.pid=0x8052
mkrgsm1400.bootloader.tool=openocd
mkrgsm1400.bootloader.file=mkrgsm1400/samd21_sam_ba_arduino_mkrgsm1400.bin

# Arduino MKR NB 1500
# --------------------
mkrnb1500.name=Arduino MKR NB 1500
mkrnb1500.vid.0=0x2341
mkrnb1500.pid.0=0x8055
mkrnb1500.vid.1=0x2341
mkrnb1500.pid.1=0x0055

mkrnb1500.upload.tool=bossac
mkrnb1500.upload.protocol=sam-ba
mkrnb1500.upload.maximum_size=262144
mkrnb1500.upload.maximum_data_size=32768
mkrnb1500.upload.use_1200bps_touch=true
mkrnb1500.upload.wait_for_upload_port=true
mkrnb1500.upload.native_usb=true
mkrnb1500.build.mcu=cortex-m0plus
mkrnb1500.build.f_cpu=48000000L
mkrnb1500.build.usb_product="Arduino MKR NB 1500"
mkrnb1500.build.usb_manufacturer="Arduino LLC"
mkrnb1500.build.board=SAMD_MKRNB1500
mkrnb1500.build.core=arduino
mkrnb1500.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
mkrnb1500.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrnb1500.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrnb1500.build.variant=mkrnb1500
mkrnb1500.build.vid=0x2341
mkrnb1500.build.pid=0x8055
mkrnb1500.bootloader.tool=openocd
mkrnb1500.bootloader.file=mkrnb1500/samd21_sam_ba_arduino_mkrnb1500.bin

# Arduino MKR Vidor 4000
# --------------------
mkrvidor4000.name=Arduino MKR Vidor 4000
mkrvidor4000.vid.0=0x2341
mkrvidor4000.pid.0=0x8056
mkrvidor4000.vid.1=0x2341
mkrvidor4000.pid.1=0x0056

mkrvidor4000.upload.tool=bossacI
mkrvidor4000.upload.protocol=sam-ba
mkrvidor4000.upload.maximum_size=262144
mkrvidor4000.upload.maximum_data_size=32768
mkrvidor4000.upload.use_1200bps_touch=true
mkrvidor4000.upload.wait_for_upload_port=true
mkrvidor4000.upload.native_usb=true
mkrvidor4000.build.mcu=cortex-m0plus
mkrvidor4000.build.f_cpu=48000000L
mkrvidor4000.build.usb_product="Arduino MKR Vidor 4000"
mkrvidor4000.build.usb_manufacturer="Arduino LLC"
mkrvidor4000.build.board=SAMD_MKRVIDOR4000
mkrvidor4000.build.core=arduino
mkrvidor4000.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
mkrvidor4000.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrvidor4000.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrvidor4000.build.variant=mkrvidor4000
mkrvidor4000.build.vid=0x2341
mkrvidor4000.build.pid=0x8056
mkrvidor4000.bootloader.tool=openocd
mkrvidor4000.bootloader.file=mkrvidor4000/samd21_sam_ba_arduino_mkrvidor4000.bin

# Adafruit Circuit Playground M0
# ------------------------------
adafruit_circuitplayground_m0.name=Adafruit Circuit Playground Express
adafruit_circuitplayground_m0.vid.0=0x239A
adafruit_circuitplayground_m0.pid.0=0x8018
adafruit_circuitplayground_m0.vid.1=0x239A
adafruit_circuitplayground_m0.pid.1=0x0018
adafruit_circuitplayground_m0.upload.tool=bossac
adafruit_circuitplayground_m0.upload.protocol=sam-ba
adafruit_circuitplayground_m0.upload.maximum_size=262144
adafruit_circuitplayground_m0.upload.maximum_data_size=32768
adafruit_circuitplayground_m0.upload.use_1200bps_touch=true
adafruit_circuitplayground_m0.upload.wait_for_upload_port=true
adafruit_circuitplayground_m0.upload.native_usb=true
adafruit_circuitplayground_m0.build.mcu=cortex-m0plus
adafruit_circuitplayground_m0.build.f_cpu=48000000L
adafruit_circuitplayground_m0.build.usb_product="Circuit Playground Express"
adafruit_circuitplayground_m0.build.usb_manufacturer="Adafruit"
adafruit_circuitplayground_m0.build.board=SAMD_CIRCUITPLAYGROUND_EXPRESS
adafruit_circuitplayground_m0.build.core=arduino
adafruit_circuitplayground_m0.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ {build.usb_flags}
adafruit_circuitplayground_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_circuitplayground_m0.build.openocdscript=openocd_scripts/arduino_zero.cfg
adafruit_circuitplayground_m0.build.variant=circuitplay
adafruit_circuitplayground_m0.build.variant_system_lib=
adafruit_circuitplayground_m0.build.vid=0x239A
adafruit_circuitplayground_m0.build.pid=0x8018
adafruit_circuitplayground_m0.bootloader.tool=openocd
adafruit_circuitplayground_m0.bootloader.file=circuitplay/circuitplay_m0_samd21g18_sam_ba.bin

